// -----------------------------------------TASK 1------------------------------------------//
// 1 Створити метод об'єкту який буде приймати 1 параметр назву факультету та повертати списoк імен учнів факультету
// 2 Створити метод об'єкту який буде приймати 1 параметр назву факультету та повертати кількість очків факультета
// 3 Створити метод об'єкту який буде виводити ім'я факультету в якого більше очків

const hogvarts = {
    griffindor: [
        {
            name: 'Harry',
            points: 17,
        },
        {
            name: 'Hermiona',
            points: 19,
        },
        {
            name: 'Ron',
            points: 14,
        },
    ],
    sliserin: [
        {
            name: 'Draco',
            points: 47,
        },
        {
            name: 'Goyl',
            points: 14,
        },
        {
            name: 'Crabbe',
            points: 5,
        },
    ],
}